"""Сообщения бота"""

msg_start = 'Добро пожаловать в торговый бот.'
msg_help = 'Этот бот предназначен для управления торговыми роботами для криптовалютных бирж.'
msg_trade = 'Введите валютную пару для начала торговли роботом.'
msg_stop_trade = 'Введите валютную пару для остановки торговли роботом.'
msg_start_binance = 'Вы выбрали биржу Binance'
msg_stop_bybit = 'Остановка торговли на Bybit'
msg_stop_binance = 'Остановка торговли на Binance'
msg_registered = 'Вы уже зарегистрированы.'
msg_success_registered = 'Вы успешно зарегистрированы.'
msg_error_user = 'Превышено максимальное количество пользователей.'
msg_chose_exchange = 'Пожалуйста выберите биржу.'

msg_error_coin_run = 'Неверная длина пары, начните заново.\n'
msg_error_name_coin_run = 'Неверное имя пары, начните заново.\n'
msg_error_coin_stop = 'Неверная длина пары, начните заново.\n'
msg_error_name_coin_stop = 'Неверное имя пары, начните заново.\n'
msg_error_command = 'Ошибка при отправке команды, проверьте запущен ли робот на этой паре.'

msg_success_start = 'Успешно запущено.'
msg_success_stop = 'Успешно остановлено.\nДля возвращения к выбору биржи используйте - trade'
